Tekla Open API Reference for Tekla Structures 2025
Picker.PickPointEnum Enumeration
 The possible point pick types.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum PickPointEnum
Public Enumeration PickPointEnum
Members
Member name | Value | Description
PICK_ONE_POINT | 0 |  Pick one point (x,y,z).
PICK_TWO_POINTS | 1 |  Pick two points.
PICK_POLYGON | 2 |  Pick multiple points.
PICK_LINE | 3 |  Pick one line.
PICK_FACE | 4 |  Pick one face.
See Also
Reference
Tekla.Structures.Model.UI Namespace